Repository: jotak/shahnarman
Catalog: GameRoot/data/i18n/*.po
Languages: french

source: melee
french: mêlée

source: range
french: distance

source: armor
french: armure

source: speed
french: vitesse

source: life
french: vie

# moves
source: moves left
french: mouvements restants

source: Alignment
french: Alignement

source: food
french: nourriture

source: Life mana
french: Mana de vie

source: Law mana
french: Mana de loi

source: Death mana
french: Mana de mort

source: Chaos mana
french: Mana de chaos

# INFINITE(TIMER)
source: Infinite
french: Infinie

# CHOOSE_MAGIC_PATH
source: Choose a magic path
french: Choisissez une voie de magie

# CHOOSE_CHARACTER_TRAIT
source: Choose a personal trait
french: Choisissez un trait personnel

# (A)_SPELL_IN_DECK
source: a spell from deck
french: un sort de la pioche

# (A)_SPELL_IN_HAND
source: a spell from hand
french: un sort en main

# (A)_SPELL_IN_PLAY
source: an active spell
french: un sort actif

# (A)_SPELL_IN_DISCARD
source: a discarded spell
french: un sort de la défausse

source: a player
french: un joueur

source: a tile
french: une case de terrain

# (A)_UNIT
source: an unit
french: une unité

source: a dead unit
french: une unité morte

source: a town
french: une ville

# (A)_BUILDING
source: a building in town
french: un bâtiment de ville

source: a temple
french: un temple

source: in range
french: à portée

# FRIEND(UNIT)
source: friend
french: allié(e)

# ENEMY(UNIT)
source: enemy
french: adverse

source: The spell
french: Le sort

source: The skill
french: La compétence

# %$1s_%$2s_NEEDS_SELECT_TARGET_%$3s_WITH_CONSTRAINTS_%$4s
source: %$1s '%$2s' needs to select a target %$4s %$3s.
french: %$1s '%$2s' nécessite de sélectionner %$3s %$4s.

source: Neutral
french: Neutre

source: Artifact
french: Artefact

# ALREADY_OWN
source: You already own this Shahmah.
french: Vous possédez déjà ce Shahmah.

# NEED_MORE_CASH
source: You need more cash!
french: Vous n'avez pas assez d'argent!

source: Spell
french: Sort

source: Skill
french: Compétence

source: price
french: prix

source: your cash:
french: votre fric :

source: Cancel
french: Annuler

source: Buy
french: Acheter

# ETHNICITY
source: People
french: Peuple

source: Skills
french: Compétences

source: None
french: aucun

source: life
french: vie

source: law
french: loi

source: death
french: mort

# YOU_GOT_%$1ld_AT_THROW_THE_MAP
source: You've got %$1ld at throwing the map!
french: Vous obtenez %$1ld au lancé de carte!

# TTH_SCORE_1
source: Heyy! Did you throw the map away? Don't do that!
french: Hééé toi là! T'as jeté la carte? Mais faut pas faire ça!

# TTH_SCORE_2
source: Hmm, it's a nice try. But can do better.
french: Mouais, pas mal. Mais peut mieux faire.

# TTH_SCORE_3
source: What a nice shot!!! Impressive!
french: Quel beau tir!!! Impressionant!

# TTH_SCORE_4
source: Looks like you're a professional map-thrower!
french: Vous devez être un lanceur de carte professionnel!

# TTH_SCORE_5
source: Wooooowwooo!!! More than 500.000! You're the best!!
french: Woooowooowoo!!! Plus de 500 000! Vous êtes le meilleur!

# TTH_SCORE_6
source: THE MILLION, THE MILLION, THE MILLION!!!!!! YEEAAAAAHHHHHHH!
french: LE MILLION, LE MILLION, LE MILLION!!!!!!! YEEEHHHAAAA!

source: Highest influence: %$1s
french: Meilleure influence : %$1s

source: Magic circle (%$1s)
french: Cercle de magie (%$1s)

source: plain
french: plaine

source: forest
french: forêt

source: mountain
french: montagne

source: desert
french: désert

source: sea
french: mer

source: Temple of %$1s (%$2s)
french: Temple de %$1s (%$2s)

source: Town of %$1s (%$2s)
french: Ville de %$1s (%$2s)

# (1s)_TOWN_CAPTURED_(2s)
source: %$1s has been captured by %$2s.
french: %$1s a été capturée par %$2s.

# (s)_TOWN_LIBERATED
source: %$1s has been liberated by neutral forces.
french: %$1s a été libérée par les forces neutres.

# TOWN_(s)_HAS_GROWN_TO_(d)
source: %$1s has grown to size %$2d.
french: %$1s est désormais de taille %$2d.

# IT_IS_NOW_CAPITAL_OF_(s)
source: It is now %$1s's capital!
french: C'est devenu la capitale de %$1s!

# BUILDING_(1s)_WAS_BUILT_IN_(2s)
source: A %$1s was built in %$2s.
french: Un(e) %$1s a été construit(e) à %$2s.

# (1s)_PRODUCED_UNIT_(2s)
source: %$1s has produced %$2s.
french: %$1s a formé une unité de %$2s.

source: %$1s has turned coat for %$2s!
french: %$1s a retourné sa veste pour %$2s!

# A_HEROE_%$1s_IS_BORN_FOR_%$2s
source: A hero, %$1s, is born for %$2s.
french: Un héros, %$1s, est né pour %$2s.

source: dead
french: mort

source: Yes
french: Oui

source: No
french: Non

source: Click to change banner.
french: Cliquez pour changer de blason.

source: Level up
french: Niveau suivant

# CLICK_TO_EDIT_NAME_DESCR
source: Click to customize name and description.
french: Cliquez pour personnaliser le nom et la description.

# DELETE_AVATAR
source: Delete Shahmah
french: Supprimer ce Shahmah

source: Filters:
french: Filtres :

source: Include
french: Inclure

# HEAD
source: the head
french: la tête

source: %$1s artifacts for %$2s.
french: %$1s les artefacts pour %$2s.

# BODY
source: the body
french: le corps

# LEFT_HAND
source: the left hand
french: la main gauche

# RIGHT_HAND
source: the right hand
french: la main droite

# FOOT
source: the foot
french: les pieds

# %$1s_ARTIFACTS_EQUIPPED_BY_ANOTHER
source: %$1s artifacts equipped by another Shahmah.
french: %$1s les artefacts équipés par un autre Shahmah.

source: Spells
french: Sorts

source: Shop
french: Boutique

source: Main menu
french: Menu principal

source: Not equipped
french: Non équipés

source: Equipped
french: Equipés

# REALLY_DELETE_AVATAR
source: Do you really want to delete this Shahmah?
french: Voulez-vous vraiment supprimer ce Shahmah?

source: %$1s spells from edition %$2s.
french: %$1s les sorts de l'édition %$2s.

# %s_AVATARS
source: %s's Shahmahs
french: Shahmahs de %s

# SPELLS_(d)
source: Number of spells: %d
french: Nombre de sorts : %d

# TOTAL_XP(d1)_NEXT(d2)
source: Total XP: %$1d (next level: %$2d)
french: XP totale : %$1d (prochain niveau : %$2d)

# (s)_CAN_CAST_BATTLE_SPELLS
source: %s: you can now cast battle spells and/or click on "Finish".
french: %s : vous pouvez maintenant lancer des sorts de bataille, ou cliquer sur "Terminer".

source: Finish
french: Terminer

# FINISH_FOR_BATTLE
source: Finish for this battle
french: Terminer pour cette bataille

source: Stop timer
french: Arrêter le compteur

# _(1s)_SPELLS_TYPE_(2s)_
source: %1$s spells of type %2$s.
french: %$1s les sorts de type %$2s.

source: battle
french: combat

source: adventure
french: aventure

# _(s)_SPELLS_EQUIPPED_BY_ANOTHER
source: %s spells equipped by another Shahmah.
french: %s les sorts équipés par un autre Shahmah.

source: Equipments
french: Equipements

# SHOW_HIDE_ALL_IDENTICAL_SPELLS
source: Show or hide identical spells
french: Afficher ou masquer les sorts identiques

source: Cost
french: Coût

# ENTER_AVATAR_NAME
source: Shahmah's name
french: Nom du Shahmah

# ENTER_AVATAR_DESCRIPTION
source: Shahmah's description
french: Description du Shahmah

source: << Back
french: << Retour

source: Pay gold
french: Payer en or

source: Allows to increase available points
french: Permet d'augmenter les points disponibles

# REMAINS_%$1d_UNUSED_POINTS_WISH_CONTINUE
source: There's still %$1d unused points. Do you want to continue anyway?
french: Il vous reste encore %$1d points inutilisés. Voulez-vous continuer?

source: VICTORY:
french: VICTOIRE :

source: SHARED VICTORY:
french: VICTOIRE PARTAGEE :

# GAINED_XP(d1)_BEFORE(d2)
source: Gained XP: %$1d (was %$2d before ponderation)
french: XP gagnée : %$1d (%$2d avant pondération)

source: Game name:
french: Nom de la partie :

source: default
french: par défaut

source: Map type:
french: Type de carte :

source: Start!
french: Lancer!

# NEED_TWO_PLAYERS
source: You need at least 2 players to start a game.
french: Il faut au moins 2 joueur pour commencer une partie.

source: Server options
french: Options du serveur

source: Turn timer
french: Durée des tours

source: second
french: seconde

source: seconds
french: secondes

source: hour
french: heure

source: hours
french: heures

# DECK_MAX_SIZE
source: Deck maximum size
french: Taille de pioche max.

# UNLIMITED(DECK_SIZE)
source: Unlimited
french: Illimitée

source: Show information
french: Afficher les informations

# CHANGE_PLAYER_COLOR
source: Change player's color
french: Changer la couleur du joueur

source: Closed
french: Fermé

# WARNING_AVATAR_HAS_TOO_MUCH_SPELLS
source: Warning: this Shahmah has too many spells regarding server restrictions. Some random spells will be removed when the game starts.
french: Attention : ce Shahmah possède trop de sorts par rapport aux limitations imposées par le serveur. Certains sorts seront aléatoirement retirés en début de partie.

# CANNOT_SELECT_AVATAR_TWICE
source: You can't have the same Shahmah selected twice.
french: Vous ne pouvez pas sélectionner deux fois le même Shahmah.

source: Cash: %d
french: Pognon : %d

# DISPUTED_GAMES_(d)_WON_(d)_LOST_(d)
source: Number of disputed games: %d (won: %d, lost: %d)
french: Nombre de parties disputées : %d (gagnées : %d, perdues : %d)

# PCT_VICTORIES_(d)
source: Percentage of victories: %d
french: Pourcentage de victoires : %d

# AVATARS_(d)
source: Number of Shahmahs: %d
french: Nombre de Shahmahs : %d

# PLEASE_WAIT_WHILE_SERVER_STARTING
source: Please wait while the server is starting...
french: Veuillez patienter pendant que le serveur démarre...

# GAME_NAME_ALREADY_EXIST
source: This game name already exist, previous saved game will be erased. Do you want to continue?
french: Une précédente partie existe déjà sous ce nom, elle sera supprimée. Voulez-vous continuer?

source: Info
french: Infos

source: waiting
french: en attente

source: playing
french: actif

source: finished
french: terminé

source: connection problem
french: problème de connexion

# WAIT_WHILE_FINISHING_TURNS
source: Please wait while other players finish their turn.
french: Patientez pendant que les autres joueurs finissent leur tour.

source: Choose next player:
french: Choisissez le prochain joueur :

source: Resume game
french: Reprendre le jeu

source: Save game
french: Sauvegarder la partie

source: Quit
french: Quitter

# SPELL_(s)_ASK_EXTRA_MANA
source: Spell %s asks for extra mana
french: Le sort %s demande du mana additionnel

# SKILL_(s)_ASK_EXTRA_MANA
source: Skill %s asks for extra mana
french: La capacité %s demande du mana additionnel

source: No mana available.
french: Pas de mana disponible.

# (s)_LEVELED_UP_AND_IS_(d)
source: %s has just gained a level and is now level %d! You must choose a path:
french: %s a gagné un niveau et atteint le niveau %d! Vous devez choisir une amélioration :

source: Do it later
french: Plus tard

# DO_IT_LATER_EXPL
source: You can do it later from the Shahmah panel in the "Build deck" window.
french: Vous pourrez revenir depuis le panneau Shahmah de la fenêtre "Construire un deck".

source: Load game
french: Charger une partie

source: Log
french: Journal

source: See
french: Voir

source: New turn
french: Nouveau tour

source: turn(s)
french: tour(s)

# PRODUCING_NOTHING
source: Nothing being produced
french: Pas de formation en cours.

source: Owned by %s.
french: Appartient à %s.

source: Skills and active effects
french: Capacités et effets actifs

source: Grows in %$1d turns.
french: Grandit dans %$1d tour(s).

source: Citizens are very unhappy.
french: La population est très mécontente.

source: Citizens are unhappy.
french: La population est mécontente.

source: Citizens are a bit unhappy.
french: La population est un peu mécontente.

# CITIZENS_ARE_NEUTRAL
source: Citizens are indifferent.
french: La population est indifférente.

source: Citizens are very happy.
french: La population est très heureuse.

source: Citizens are happy.
french: La population est heureuse.

source: Citizens are a bit happy.
french: La population est assez heureuse.

# FEAR_DESCRIPTION_NULL
source: Citizens have no fear. It increases a lot the chances that a hero appears.
french: La population n'a pas peur. Cela augmente beaucoup les chances d'apparition d'un héros.

# FEAR_DESCRIPTION_LOW
source: Citizens doesn't have much fear. It increases the chances that a hero appears.
french: La population n'a pas très peur. Cela augmente les chances d'apparition d'un héros.

# FEAR_DESCRIPTION_AVERAGE
source: Some citizens have fear. Chances that a hero appears are medium.
french: La population a assez peur. Il y a quelques chances pour qu'un héros apparaisse.

# FEAR_DESCRIPTION_HIGH
source: Citizens are affraid. Chances that a hero appears are low.
french: La population a très peur. Il y a peu de chances pour qu'un héros apparaisse.

# BUILDING_NOTHING
source: No building in progress.
french: Pas de construction en cours.

source: Produce unit
french: Former une unité

# NONE(UNITS_LIST)
source: None
french: Aucune

source: Active effects
french: Effets actifs

# MOVE_TO_POS
source: Move to this position
french: Se déplacer vers cette case

source: Attack %s
french: Attaquer %s

source: Game options
french: Options de jeu

# VIDEO_OPTIONS
source: Graphic options
french: Options graphiques

source: Audio options
french: Options audio

# CLOSES_IN_(d)_SEC
source: (Closes in %d seconds)
french: (Se fermera dans %d secondes)

source: Language:
french: Langue :

# AVAILABLE_EDITIONS
source: Active editions
french: Editions actives

# KEEP_LOGS
source: Keep logs for:
french: Conserver le journal sur :

# UNLIMITED(KEEP_LOGS)
source: Unlimited
french: Illimité

# %$1d_TURNS(KEEP_LOGS)
source: %$1d turns
french: %$1d tours

source: Fullscreen
french: Plein écran

source: Screen resolution
french: Résolution

source: Sound volume
french: Volume des sons

source: 0 (mute)
french: 0 (muet)

source: Music volume
french: Volume des musiques

# LANGUAGE_CHANGE_ON_RESTART
source: You must quit and restart the game to see the selected language.
french: Vous devez redémarrer le jeu pour prendre en compte la langue sélectionnée.

# CONFIRM_RESOLUTION
source: Click Ok to accept this resolution. Else, the game will enter in windowed mode for security.
french: Cliquez sur Ok pour confirmer la résolution choisie. Sinon, le jeu passera en mode fenetré par sécurité.

source: Close
french: Fermer

source: Resolve
french: Résolution

# IGNORE_BATTLES
source: Ignore these battles
french: Ignorer ces combats

source: Select battle
french: Sélectionner la bataille

source: Attackers
french: Attaquants

source: Defenders
french: Défenseurs

source: Next >>
french: Suivant >>

source: Range attack
french: Attaque à distance

source: Melee attack
french: Corps à corps

# WAIT_SPELLS
source: Please wait, other players might cast spells.
french: Attendez un moment, d'autres joueurs peuvent lancer des sorts.

# (s)_CHOOSE_BATTLE
source: %s: select a battle on the map, or skip your turn.
french: %s : choisissez une bataille sur la carte, ou passez votre tour.

source: Processing AI (%$1s)
french: IA %$1s

source: Processing neutral AI
french: Joueur neutre

source: Resolving spells (%s)
french: Résolution des sorts (%s)

source: Resolving moves (%s)
french: Résolution des mouvements (%s)

# WAIT_(s)_CHOOSING_BATTLES
source: Please wait, %s is choosing battles.
french: Attendez un moment, %s choisit ses batailles.

# (s)_SELECT_ATTACKER_AND_TARGET
source: %s: select your attacker and your opponent.
french: %s : sélectionnez votre attaquant et votre adversaire.

# (1s)_IS_ATTACKING_(2s)_CAN_CAST_SPELLS
source: %1$s is attacking %2$s. You can cast spells now.
french: %$1s lance une attaque contre %$2s. Vous pouvez maintenant lancer un sort.

# NO_MORE_BATTLES_CAN_CAST_SPELLS
source: No more battle this turn. You can cast any instant spell before next turn.
french: Plus de bataille ce tour-ci. Vous pouvez lancer un sort rapide avant le prochain tour.

source: Updating towns...
french: Mise à jour des villes...

# (1s)_CAST_(2s)_SELECT_TARGET
source: %1$s: you cast %2$s. Select a valid target.
french: %$1s : vous lancez %$2s. Choisissez une cible valide.

# (1s)_ACTIVATE_(2s)_SELECT_TARGET
source: %1$s: you activate %2$s. Select a valid target.
french: %$1s : vous activez %$2s. Choisissez une cible valide.

source: Choose player
french: Choisissez un joueur

source: Create Shahmah
french: Créer un Shahmah

source: Statistics
french: Statistiques

source: Delete this player
french: Supprimer ce joueur

# ENTER_PLAYER_NAME
source: Type your player's name.
french: Entrez le nom du joueur.

# REALLY_DELETE_PLAYER
source: Do you really want to delete this player?
french: Voulez-vous vraiment supprimer ce joueur?

# CREATE_NEW
source: New player
french: Nouveau joueur

# TOTAL_SPELLS_(d)
source: Total number of spells (including from deactivated editions): %d
french: Nombre total de sorts (inclut les sorts des éditions désactivées) : %d

source: Show active spells
french: Afficher les sorts actifs

source: Show game menu
french: Afficher le menu de jeu

source: Cast on %s
french: Lancé sur %s.

source: End of turn
french: Fin du tour

# BUILD_DECK
source: Edit Shahmahs
french: Edition de Shahmahs

source: Play
french: Jouer

source: Play online
french: Jeu en ligne

source: New game
french: Nouvelle partie

source: Join LAN
french: Rejoindre LAN

source: Unit options
french: Options d'unité

source: Defend
french: Défendre

source: Move to
french: Déplacer

source: Attack
french: Attaquer

source: Available mana
french: Mana disponible

# PLAYER_(s1)_DEAD
source: Player %$1s is dead!
french: Le joueur %$1s est mort!

# (1s)_(2s)_DIED
source: %1$s died (player %2$s).
french: %$1s est mort (joueur %$2s).

# (s1)_CAST_(s2)_FAILED
source: %$1s tried to cast %$2s but it failed!
french: %$1s a voulu lancer %$2s mais a échoué!

source: %$1s cast %$2s on %$3s.
french: %$1s a lancé %$2s sur %$3s.

source: %$1s cast %$2s.
french: %$1s a lancé %$2s.

# %$1s_WAS_ACTIVATED_ON_%$2s
source: %$1s was activated %$2s.
french: %$1s a été activé sur %$2s.

source: %$1s activated %$2s on %$3s.
french: %$1s a activé %$2s sur %$3s.

source: %s effect on %s ended.
french: L'effet %s sur %s a pris fin.

# GAME_SAVED_SUCCESS
source: Game saved.
french: Partie sauvegardée.

# (s)_TRIED_CAST_SPELL_BUT_NO_MANA
source: %s needs more mana to cast a spell!
french: %s manque de mana pour lancer un sort!

# (s)_CANT_FIND_SPELL
source: %s has lost a spell before casting it!
french: %s a perdu un sort au moment de le lancer!

source: %$1s won %$2d gold!
french: %$1s a gagné %$2d or!

# %$1s_WON_SPELL_%$2s
source: %$1s won the spell %$2s!
french: %$1s a gagné le sort %$2s!

# %$1s_WON_ARTIFACT_%$2s
source: %$1s won the artifact %$2s!
french: %$1s a gagné l'artefact %$2s!

# %$1s_WON_AVATAR_%$2s
source: %$1s won a Shahmah: %$2s!
french: %$1s a gagné un Shahmah : %$2s!

source: %1$s attacked %2$s.
french: %$1s a attaqué %$2s.
